{
  "format": "graph-model",
  "generatedBy": "2.9.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "signature": {
    "inputs": {
      "numeric": {
        "name": "numeric:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "42" }] }
      }
    },
    "outputs": {
      "output_1": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "27" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/Reshape/shape/1",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "42" }, { "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "27" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "27" }] }
            }
          }
        }
      },
      {
        "name": "numeric",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }, { "size": "42" }] } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/Shape",
        "op": "Shape",
        "input": ["numeric"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice",
        "op": "StridedSlice",
        "input": [
          "StatefulPartitionedCall/sequential/dense_features/numeric/Shape",
          "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack",
          "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack_1",
          "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack_2"
        ],
        "attr": {
          "new_axis_mask": { "i": "0" },
          "Index": { "type": "DT_INT32" },
          "shrink_axis_mask": { "i": "1" },
          "T": { "type": "DT_INT32" },
          "ellipsis_mask": { "i": "0" },
          "begin_mask": { "i": "0" },
          "end_mask": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/Reshape/shape",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice",
          "StatefulPartitionedCall/sequential/dense_features/numeric/Reshape/shape/1"
        ],
        "attr": {
          "N": { "i": "2" },
          "axis": { "i": "0" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_features/numeric/Reshape",
        "op": "Reshape",
        "input": [
          "numeric",
          "StatefulPartitionedCall/sequential/dense_features/numeric/Reshape/shape"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense_features/numeric/Reshape",
          "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense/Relu",
          "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": { "i": "1" },
          "transpose_a": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "epsilon": { "f": 0.0 },
          "transpose_b": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_2/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense_1/Relu",
          "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_a": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_3/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense_2/Relu",
          "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "transpose_b": { "b": false },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_4/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense_3/Relu",
          "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": { "i": "1" },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_4/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/sequential/dense_4/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential/dense_4/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1087 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack_1",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_features/numeric/strided_slice/stack_2",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_features/numeric/Reshape/shape/1",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "shape": [42, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp",
          "shape": [128, 27],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_4/BiasAdd/ReadVariableOp",
          "shape": [27],
          "dtype": "float32"
        }
      ]
    }
  ]
}
