{
  "format": "layers-model",
  "generatedBy": "keras v2.9.0",
  "convertedBy": "TensorFlow.js Converter v3.19.0",
  "modelTopology": {
    "keras_version": "2.9.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "DenseFeatures",
            "config": {
              "name": "dense_features",
              "trainable": true,
              "dtype": "float32",
              "feature_columns": [
                {
                  "class_name": "NumericColumn",
                  "config": {
                    "key": "numeric",
                    "shape": [42],
                    "default_value": null,
                    "dtype": "float32",
                    "normalizer_fn": null
                  }
                }
              ],
              "partitioner": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 27,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": {
          "numeric": [null, 42]
        }
      }
    },
    "training_config": {
      "loss": {
        "class_name": "SparseCategoricalCrossentropy",
        "config": {
          "reduction": "auto",
          "name": "sparse_categorical_crossentropy",
          "from_logits": false
        }
      },
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "sparse_categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "sequential/dense/kernel",
          "shape": [42, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_1/kernel",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_1/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_2/kernel",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_2/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_3/kernel",
          "shape": [128, 128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_3/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_4/kernel",
          "shape": [128, 27],
          "dtype": "float32"
        },
        {
          "name": "sequential/dense_4/bias",
          "shape": [27],
          "dtype": "float32"
        }
      ]
    }
  ]
}
